export interface TaskData {
  title: string;
  id: string | number;
  name: string;
  description: string;
}

export const dataMock: {
  title: string;
  id: number;
  name: string;
  description: string;
}[] = [
  {
    title: "Backlog",
    id: 1,
    name: "Login page – performance issues",
    description:
      "Описание 1. Это был темный лес, издали казавшийся непроходимым. Там Пахапиль охотился, глушил рыбу, спал на еловых ветках. Короче – жил, пока русские не выгнали оккупантов.",
  },
  {
    title: "Backlog",
    id: 2,
    name: "Sprint bugfix",
    description:
      "",
  },
  {
    title: "Ready",
    id: 3,
    name: "Shop page – performance issues",
    description:
      "Описание 3. Это был темный лес, издали казавшийся непроходимым. Там Пахапиль охотился, глушил рыбу, спал на еловых ветках. Короче – жил, пока русские не выгнали оккупантов.",
  },
  {
    title: "Ready",
    id: 4,
    name: "Checkout bugfix",
    description:
      "Описание 4. Это был темный лес, издали казавшийся непроходимым. Там Пахапиль охотился, глушил рыбу, спал на еловых ветках. Короче – жил, пока русские не выгнали оккупантов.",
  },

  {
    title: "Ready",
    id: 5,
    name: "Shop bug 1",
    description:
      "Описание 5. Это был темный лес, издали казавшийся непроходимым. Там Пахапиль охотился, глушил рыбу, спал на еловых ветках. Короче – жил, пока русские не выгнали оккупантов.",
  },
  {
    title: "Ready",
    id: 6,
    name: "Shop bug 2",
    description:
      "Описание 6. Это был темный лес, издали казавшийся непроходимым. Там Пахапиль охотился, глушил рыбу, спал на еловых ветках. Короче – жил, пока русские не выгнали оккупантов.",
  },
  {
    title: "Ready",
    id: 7,
    name: "Shop bug 3",
    description:
      "Описание 7. Это был темный лес, издали казавшийся непроходимым. Там Пахапиль охотился, глушил рыбу, спал на еловых ветках. Короче – жил, пока русские не выгнали оккупантов.",
  },
  {
    title: "In progress",
    id: 8,
    name: "User page – performance issues",
    description:
      "Описание 8. Это был темный лес, издали казавшийся непроходимым. Там Пахапиль охотился, глушил рыбу, спал на еловых ветках. Короче – жил, пока русские не выгнали оккупантов.",
  },
  {
    title: "In progress",
    id: 9,
    name: "Auth bugfix",
    description:
      "Описание 9. Это был темный лес, издали казавшийся непроходимым. Там Пахапиль охотился, глушил рыбу, спал на еловых ветках. Короче – жил, пока русские не выгнали оккупантов.",
  },
  {
    title: "Finished",
    id: 10,
    name: "Main page – performance issues",
    description:
      "Описание 9. Это был темный лес, издали казавшийся непроходимым. Там Пахапиль охотился, глушил рыбу, спал на еловых ветках. Короче – жил, пока русские не выгнали оккупантов.",
  },
  {
    title: "Finished",
    id: 11,
    name: "Main page bugfix",
    description:
      "Описание 9. Это был темный лес, издали казавшийся непроходимым. Там Пахапиль охотился, глушил рыбу, спал на еловых ветках. Короче – жил, пока русские не выгнали оккупантов.",
  },
  {
    title: "Ready",
    id: 12,
    name: "Shop bug 4",
    description:
      "Описание 12. Это был темный лес, издали казавшийся непроходимым. Там Пахапиль охотился, глушил рыбу, спал на еловых ветках. Короче – жил, пока русские не выгнали оккупантов.",
  },
  {
    title: "Ready",
    id: 13,
    name: "Shop bug 5",
    description:
      "Описание 13. Это был темный лес, издали казавшийся непроходимым. Там Пахапиль охотился, глушил рыбу, спал на еловых ветках. Короче – жил, пока русские не выгнали оккупантов.",
  },
  {
    title: "Ready",
    id: 14,
    name: "Shop bug 6",
    description:
      "Описание 14. Это был темный лес, издали казавшийся непроходимым. Там Пахапиль охотился, глушил рыбу, спал на еловых ветках. Короче – жил, пока русские не выгнали оккупантов.",
  },
  {
    title: "Ready",
    id: 15,
    name: "Shop page – performance issues",
    description:
      "Описание 15. Это был темный лес, издали казавшийся непроходимым. Там Пахапиль охотился, глушил рыбу, спал на еловых ветках. Короче – жил, пока русские не выгнали оккупантов.",
  },
  {
    title: "Ready",
    id: 16,
    name: "Shop bug 7",
    description:
      "Описание 16. Это был темный лес, издали казавшийся непроходимым. Там Пахапиль охотился, глушил рыбу, спал на еловых ветках. Короче – жил, пока русские не выгнали оккупантов.",
  },
  {
    title: "Ready",
    id: 17,
    name: "Shop page load",
    description:
      "Описание 17. Это был темный лес, издали казавшийся непроходимым. Там Пахапиль охотился, глушил рыбу, спал на еловых ветках. Короче – жил, пока русские не выгнали оккупантов.",
  },
];
